# 백준 [뱀]
# 시뮬레이션

def turn(d, c):
    # 동, 남, 서, 북 (0, 1, 2, 3)
    # 왼쪽으로 90도 회전 0 -> 3 -> 2 -> 1
    
    # 오른쪽으로 90도 회전 0 -> 1 -> 2 -> 3
    

def simulate():
    # 뱀의 머리 위치
    
    # 뱀이 존재하는 위치는 2로 표시
   
    # 처음에는 direction 동쪽(0)
    
    # 시작한 뒤로부터 흐른 시간
    
    # 다음에 회전할 정보
    
    # 뱀 (큐로 표현)

    
        # 이동한 위치 계산
        
        # 이동한 위치가 맵 범위 안에 있고, 뱀의 몸통이 없는 위치일 때
        
            # 사과가 없다면 이동 후 꼬리 제거
            
                # 뱀 머리 이동
                
                #꼬리 제거
                
            #사과가 있다면 이동 후 꼬리 그대로
            
        #벽이나 몸통에 부딪혔다면
        

        # 실행할 때마다 time 및 뱀 머리 이동
        

        #회전할 시간의 경우
        


# 맵 정보

# 방향 전환 정보

# 처음에 동쪽을 보고 있으므로 (동 0, 남 1, 서 2, 북 3)


# 사과가 있는 곳은 1로


